doc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>u/prequelmemes<sub>bot</sub> Documentation</title>
<!-- 2018-05-04 Fri 11:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="thecsw" />
</head>
<body>
<div id="content">
<h1 class="title">u/prequelmemes<sub>bot</sub> Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Getting started</a>
<ul>
<li><a href="#sec-1-1">1.1. Prerequisites</a></li>
<li><a href="#sec-1-2">1.2. Other Dependencies</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Linux</a></li>
<li><a href="#sec-1-2-2">1.2.2. Mac OS (homebrew)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Installing</a></li>
<li><a href="#sec-3">3. Deployment</a></li>
<li><a href="#sec-4">4. Source code</a></li>
<li><a href="#sec-5">5. Built With</a></li>
<li><a href="#sec-6">6. Authors</a></li>
<li><a href="#sec-7">7. License</a></li>
</ul>
</div>
</div>
<p>
<b>Hello there!</b>
</p>

<p>
Welcome to the source page of u/prequelmemes<sub>bot</sub>! Nice to meet you. First of all, let me talk you through what the bot does and details later.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
<p>
These instructions will get you a copy of the project up and running on your local machine for development and testing purposes. 
See deployment for notes on how to deploy the project on a live system.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-screen">sudo pip install praw
sudo pip install python-opencv
sudo pip install pytesseract
sudo pip install tesseract-ocr
sudo pip install Pillow
sudo pip install tqdm
</pre>
</div>

<p>
OR
</p>

<div class="org-src-container">

<pre class="src src-screen">pip install --upgrade -r requirements.txt
</pre>
</div>
<ol class="org-ol">
<li><a href="https://github.com/praw-dev/praw">praw</a> is Python Reddit API Wrapper. This will be the main and only package to
connect to Reddit's API and extract desired data.
</li>
<li><a href="https://pypi.python.org/pypi/opencv-python">python-opencv</a> is used for image transformations and computer vision problems.
</li>
<li><a href="https://pypi.python.org/pypi/pytesseract">pytesseract</a> is a python wrapper for Google's Tesseract-OCR.
</li>
<li><a href="https://pillow.readthedocs.io/en/latest/">Pillow</a> is the Python  Imaging Library by Fredrik Lundh and Contributors.
</li>
<li><a href="https://pypi.python.org/pypi/tqdm">tqdm</a> is used for fancy progress bars.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Other Dependencies</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Tesseract engine should be installed on a local machine to run the text
recognition properly. We will also install the tesseract OCR trained 
languages for better accuracy and we will install only the English 
packages. For more information about other languages, please refer to 
tesseract's official 
<a href="https://github.com/tesseract-ocr/tesseract">repository on Github</a>.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Linux</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>Debian, Ubuntu (aptitude)<br  /><div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">

<pre class="src src-screen">sudo apt-get install tesseract-ocr
sudo apt-get install tesseract-ocr-eng
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>Arch Linux (pacman)<br  /><div class="outline-text-5" id="text-1-2-1-2">
<div class="org-src-container">

<pre class="src src-screen">sudo pacman -S tesseract
sudo pacman -S tesseract-data-eng
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Mac OS (homebrew)</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-screen">brew install tesseract
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installing</h2>
<div class="outline-text-2" id="text-2">
<p>
The only thing that needs to be done before execution is the config. The only
thing that needs to be done before execution is the config profile. In the
config profile you should fill your Reddit API details.
</p>

<p>
For that please follow the steps below
</p>

<div class="org-src-container">

<pre class="src src-screen">git clone https://github.com/thecsw/prequelmemes_bot
cd prequelmemes_bot
mv example.config.py config.py
nano config.py
</pre>
</div>

<p>
After filling out the details, save and exit. You're done with installation.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Deployment</h2>
<div class="outline-text-2" id="text-3">
<p>
Remove the word <b>*'example'*</b> from the title of all files with it.
</p>

<p>
Just run this
</p>

<div class="org-src-container">

<pre class="src src-screen">python __main__.py
</pre>
</div>

<p>
That is everything. All the prequelmemes will be identified. Once and for all,
the archives will never be incomplete.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Source code</h2>
<div class="outline-text-2" id="text-4">
<p>
The code is heavily commented and all the important modules are being separated into different files. Looks pretty, dunno.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Built With</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://github.com/praw-dev/praw">praw</a> is Python Reddit API Wrapper. This will be the main and only package to
connect to Reddit's API and extract desired data.
</li>
<li><a href="https://pypi.python.org/pypi/opencv-python">python-opencv</a> is used for image transformations and computer vision problems.
</li>
<li><a href="https://pypi.python.org/pypi/pytesseract">pytesseract</a> is a python wrapper for Google's Tesseract-OCR.
</li>
<li><a href="https://pypi.python.org/pypi/tqdm">tqdm</a> is used for fancy progress bars.
</li>
<li><a href="https://pillow.readthedocs.io/en/latest/">Pillow</a> is the Python  Imaging Library by Fredrik Lundh and Contributors.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Authors</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><b>Sagindyk Urazayev</b> - <i>Initial work</i> - <a href="https://github.com/thecsw">thecsw</a>
</li>
<li><b>farhank3389</b> - <i>Fixes</i> - <a href="https://github.com/farhank3389">farhank3389</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> License</h2>
<div class="outline-text-2" id="text-7">
<p>
This project is licensed under the The GNU General Public License (see the
<a href="https://github.com/thecsw/prequelmemes_bot/blob/master/LICENSE">LICENSE.md</a> file for details), it explains everything pretty well. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: thecsw</p>
<p class="date">Created: 2018-05-04 Fri 11:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
